In [1]:
import pandas as pd
df=pd.read_csv('EX_GrapeData.csv')
df

    continent  brand  size  period price
0           2      2  10.7   47.65   144
1           2      3  14.0   63.13   215
2           2      2   9.0   58.76   105
3           1      1   8.0   34.88    69
4           2      2  10.0   55.53   134
..        ...    ...   ...     ...   ...
58          1      1   5.0   16.66  21.5
59          2      1  21.0   43.00
60          2      2   5.0   12.00
61          2      3  13.0   20.00
62          2      3  31.0   19.00

[63 rows x 5 columns]

In [2]:
df.tail()

    continent  brand  size  period price
58          1      1   5.0   16.66  21.5
59          2      1  21.0   43.00
60          2      2   5.0   12.00
61          2      3  13.0   20.00
62          2      3  31.0   19.00

In [3]:
df[1:5]
df[:3]
df[60:]

    continent  brand  size  period price
60          2      2   5.0    12.0
61          2      3  13.0    20.0
62          2      3  31.0    19.0

In [4]:
df[:3]

   continent  brand  size  period price
0          2      2  10.7   47.65   144
1          2      3  14.0   63.13   215
2          2      2   9.0   58.76   105

In [5]:
df[1:5]

   continent  brand  size  period price
1          2      3  14.0   63.13   215
2          2      2   9.0   58.76   105
3          1      1   8.0   34.88    69
4          2      2  10.0   55.53   134

In [6]:
#행불러오기

In [7]:
#열불러오기

In [8]:
df[df.columns[1]]

0     2
1     3
2     2
3     1
4     2
     ..
58    1
59    1
60    2
61    3
62    3
Name: brand, Length: 63, dtype: int64

In [9]:
df[['price']]

   price
0    144
1    215
2    105
3     69
4    134
..   ...
58  21.5
59
60
61
62

[63 rows x 1 columns]

In [10]:
[df[df.columns[1]]]

[0     2
 1     3
 2     2
 3     1
 4     2
      ..
 58    1
 59    1
 60    2
 61    3
 62    3
 Name: brand, Length: 63, dtype: int64]

In [11]:
df[df.columns[[0,2,4]]]

    continent  size price
0           2  10.7   144
1           2  14.0   215
2           2   9.0   105
3           1   8.0    69
4           2  10.0   134
..        ...   ...   ...
58          1   5.0  21.5
59          2  21.0
60          2   5.0
61          2  13.0
62          2  31.0

[63 rows x 3 columns]

In [12]:
loc?

Object `loc` not found.

In [13]:
df.loc?

In [14]:
df.loc['size', 'price']

KeyError: 'size'

In [15]:
df.loc[:, 'size':[price]]

NameError: name 'price' is not defined

In [16]:
df.loc[:, 'size':'price']

    size  period price
0   10.7   47.65   144
1   14.0   63.13   215
2    9.0   58.76   105
3    8.0   34.88    69
4   10.0   55.53   134
..   ...     ...   ...
58   5.0   16.66  21.5
59  21.0   43.00
60   5.0   12.00
61  13.0   20.00
62  31.0   19.00

[63 rows x 3 columns]

In [17]:
df.iloc?

In [18]:
df.iloc[1:7], [0:2]

SyntaxError: invalid syntax (<ipython-input-18-35e305584266>, line 1)

In [19]:
df,iloc[1:7, 0:2]

NameError: name 'iloc' is not defined

In [20]:
df.iloc[1:7, 0:2]

   continent  brand
1          2      3
2          2      2
3          1      1
4          2      2
5          2      2
6          2      2

In [21]:
df.loc[0:2,:]

   continent  brand  size  period price
0          2      2  10.7   47.65   144
1          2      3  14.0   63.13   215
2          2      2   9.0   58.76   105

In [22]:
df.loc[0:2]

   continent  brand  size  period price
0          2      2  10.7   47.65   144
1          2      3  14.0   63.13   215
2          2      2   9.0   58.76   105

In [23]:
df.loc[;, 'period', 'price']

SyntaxError: invalid syntax (<ipython-input-23-37cc522cb2c7>, line 1)

In [24]:
df.loc[:, 'period':'price']

    period price
0    47.65   144
1    63.13   215
2    58.76   105
3    34.88    69
4    55.53   134
..     ...   ...
58   16.66  21.5
59   43.00
60   12.00
61   20.00
62   19.00

[63 rows x 2 columns]

In [25]:
df.at(5, 'price')

TypeError: '_AtIndexer' object is not callable

In [26]:
df.at(5, 'price')

TypeError: '_AtIndexer' object is not callable

In [27]:
df_columns=df.copy()

In [28]:
df.columns.columns

AttributeError: 'Index' object has no attribute 'columns'

In [29]:
df_columns.columns

Index(['continent', 'brand', 'size', 'period', 'price'], dtype='object')

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 63 entries, 0 to 62
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   continent  63 non-null     int64
 1   brand      63 non-null     int64
 2   size       63 non-null     float64
 3   period     63 non-null     float64
 4   price      63 non-null     object
dtypes: float64(2), int64(2), object(1)
memory usage: 2.6+ KB

In [31]:
df_columns= df_columns[['size','period','price']]
df_columns.head()

   size  period price
0  10.7   47.65   144
1  14.0   63.13   215
2   9.0   58.76   105
3   8.0   34.88    69
4  10.0   55.53   134

In [32]:
df_columns_rename(columns=['period':'time'], inplace=True)
df_columns.columns

SyntaxError: invalid syntax (<ipython-input-32-5c29416ca262>, line 1)

In [33]:
df_columns.rename(columns={'period': 'time'}, inplace=True)
df_columns.columns

Index(['size', 'time', 'price'], dtype='object')

In [34]:
df_columns['growth']=df_columns['size']/df_columns['time']
df_columns.head()

   size   time price    growth
0  10.7  47.65   144  0.224554
1  14.0  63.13   215  0.221765
2   9.0  58.76   105  0.153165
3   8.0  34.88    69  0.229358
4  10.0  55.53   134  0.180083

In [35]:
del df_columns['growth']

In [36]:
df_continent_brand=df[(df['continent']==1&(df['brand']==1)]
df_continent_brand.head()

SyntaxError: closing parenthesis ']' does not match opening parenthesis '(' (<ipython-input-36-9c2403dab10b>, line 1)

In [37]:
df_continent_brand=df[(df['continent']==1)& (df['brand']==1)]
df_continent_brand.head()

    continent  brand  size  period price
3           1      1   8.0   34.88    69
11          1      1  10.4   17.67    54
12          1      1   7.4   16.41    39
13          1      1   5.4   12.02  29.5
16          1      1   6.0   23.21    42

In [38]:
df_over_size_period=df[(df['size']>=10)&(df['period'>=30)]

SyntaxError: closing parenthesis ')' does not match opening parenthesis '[' (<ipython-input-38-25603b08bdef>, line 1)

In [40]:
df_over_size_period=df[(df['size']>=10)& (df['period']>=30)]

In [41]:
df_continent_brand=df[(df['continent']==1)& (df['brand']==1)]
df_continent_brand.head()

    continent  brand  size  period price
3           1      1   8.0   34.88    69
11          1      1  10.4   17.67    54
12          1      1   7.4   16.41    39
13          1      1   5.4   12.02  29.5
16          1      1   6.0   23.21    42

In [42]:
df_over_size_period=df[(df['size']>10)& (df['period']>=30)]
df_over_size_period.head()

   continent  brand  size  period price
0          2      2  10.7   47.65   144
1          2      3  14.0   63.13   215
5          2      2  10.5   43.14   129
6          2      2  16.0   54.86   155
7          2      1  15.0   44.14    99